//하샤드 수

//문제 설명

// 양의 정수 x가 하샤드 수라면 x의 자릿수의 합으로 x가 나누어져야 합니다.
//예를 들어 18의 자릿수 합은 1 + 8 = 9이고,
//18은 9로 나누어 떨어지므로 18은 하샤드 수입니다.
//자연수 x를 입력받아 x가 하샤드 수인지 아닌지 검사하는 함수, solution을 완성해주세요.

// 제한 조건
// x는 1 이상, 10000 이하인 정수입니다.

// 입출력 예
// x	return
// 10	true
// 12	true
// 11	false
// 13	false

// 입출력 예 설명
// 입출력 예 #1
// 10의 모든 자릿수의 합은 1입니다. 10은 1로 나누어 떨어지므로 10은 하샤드 수입니다.

// 입출력 예 #2
// 12의 모든 자릿수의 합은 3입니다. 12는 3으로 나누어 떨어지므로 12는 하샤드 수입니다.

// 입출력 예 #3
// 11의 모든 자릿수의 합은 2입니다. 11은 2로 나누어 떨어지지 않으므로 11는 하샤드 수가 아닙니다.

// 입출력 예 #4
// 13의 모든 자릿수의 합은 4입니다. 13은 4로 나누어 떨어지지 않으므로 13은 하샤드 수가 아닙니다.

// 문제 풀이 해답
function solution(x) {
  //변수 sum을 선언하고 초기값을 0으로 설정.
  //이 변수는 자릿수의 합을 계산하는 데 사용됨.
  let sum = 0;

  //주어진 정수 x를 문자열로 변환하고, 문자열을 배열로 변환
  //예를 들어, x = 18일 경우, arr = ["1", "8"]이 됨.
  let arr = String(x).split("");

  //배열 arr을 순화하며 각 요소를 정수로 변환하여 sum에 더한다
  for (let i = 0; i < arr.length; i++) {
    sum += Number(arr[i]); //1+8
  }

  //주어진 정수를 sum으로 나누었을 때 나누어지면 true를,
  //나누어지지 않으면 false를 반환
  //예를 들어, x = 18이면, sum은 9이므로 x % sum = 18 % 9 =0이므로 true를 반환
  return x % sum == 0 ? true : false;
}

//문제 풀이

function solution(x) {
  let sum = 0;
  let arr = String(x).split("");

  for (let i = 0; i < arr.length; i++) {
    sum += Number(arr[i]);
  }

  return x % sum == 0 ? true : false;
}
